
[
    {
        "name": "Wheat",
        "image": "https://picsum.photos/seed/wheat/800/600",
        "description": "A cereal grain, which is a worldwide staple food. The many species of wheat together make up the genus Triticum; the most widely grown is common wheat. It is a key source of carbohydrates and dietary fiber.",
        "planting": "Best planted in autumn for winter wheat or early spring for spring wheat. Requires well-drained soil and a sunny location. Typically sown using a drill in rows to ensure uniform depth and spacing.",
        "yield": "Average yield is about 3-4 tons per hectare, but can vary greatly depending on soil, climate, and farming practices.",
        "varieties": ["Hard Red Winter", "Soft Red Winter", "Hard Red Spring", "White Wheat", "Durum"],
        "climate": "Adaptable to various climates, but grows best in temperate regions with rainfall between 30 and 90 cm annually.",
        "soil": "Prefers well-drained loam or clay-loam soils with a pH between 6.0 and 7.0."
    },
    {
        "name": "Rice",
        "image": "https://picsum.photos/seed/rice/800/600",
        "description": "The seed of the grass species Oryza sativa (Asian rice) or Oryza glaberrima (African rice). As a cereal grain, it is the most widely consumed staple food for a large part of the world's human population.",
        "planting": "Typically grown in flooded paddies. Seedlings are first grown in a nursery and then transplanted into the fields. Requires significant water and a long, warm growing season.",
        "yield": "Average yield for irrigated rice is about 5-7 tons per hectare. Rain-fed rice yields are lower.",
        "varieties": ["Basmati", "Jasmine", "Arborio", "Brown Rice", "Sushi Rice"],
        "climate": "Requires a hot and humid climate. It is best suited to regions with high humidity, prolonged sunshine, and an assured supply of water.",
        "soil": "Best grown in clayey loam soils which can hold water for a long time. Ideal pH is between 5.5 and 6.5."
    },
    {
        "name": "Corn (Maize)",
        "image": "https://picsum.photos/seed/corn/800/600",
        "description": "A tall annual cereal grass that yields large grains, or kernels, set in rows on a cob. It is one of the most widely distributed of the world's food crops and is used for food, animal feed, and biofuel.",
        "planting": "Planted in spring in warm soil. Needs full sun and is often planted in blocks rather than single rows for better pollination. It's a heavy feeder, requiring nutrient-rich soil.",
        "yield": "Average yield can range from 8-12 tons per hectare under good conditions.",
        "varieties": ["Dent Corn", "Flint Corn", "Sweet Corn", "Popcorn", "Flour Corn"],
        "climate": "Requires warm nights and grows best in temperatures between 20°C and 30°C. Sensitive to frost.",
        "soil": "Prefers well-drained, fertile, loamy soils with good water-holding capacity and a pH of 6.0 to 6.8."
    },
    {
        "name": "Soybean",
        "image": "https://picsum.photos/seed/soybean/800/600",
        "description": "A species of legume native to East Asia, widely grown for its edible bean, which has numerous uses including soy milk, tofu, and soy oil. They are also a key component in animal feed.",
        "planting": "Planted in late spring once soil temperatures have warmed. Soybeans are nitrogen-fixing plants, which improves soil fertility.",
        "yield": "Average yield is about 2.5-3.5 tons per hectare.",
        "varieties": ["Glycine max", "Edamame", "Black Soybean"],
        "climate": "Grows best in warm and moist climates. Prefers temperatures between 20°C and 30°C.",
        "soil": "Adaptable to a wide range of soils, but grows best in moist, well-drained loams with a pH of 6.0 to 6.8."
    },
    {
        "name": "Potato",
        "image": "https://picsum.photos/seed/potato/800/600",
        "description": "A starchy tuber of the nightshade family Solanaceae, and the plant itself. Potatoes are a staple food in many parts of the world and an integral part of much of the world's food supply.",
        "planting": "Planted from 'seed potatoes' (small tubers). Plant in early spring. Requires hilling up soil around the plant to protect tubers from sunlight.",
        "yield": "Yields can range from 20 to 40 tons per hectare depending on the variety and conditions.",
        "varieties": ["Russet", "Yukon Gold", "Red Potato", "Fingerling", "Kennebec"],
        "climate": "Cool-weather crop. Ideal temperatures are between 15°C and 20°C. They are sensitive to frost.",
        "soil": "Prefers well-drained, sandy loam soil with a slightly acidic pH (5.8 to 6.5)."
    },
    {
        "name": "Tomato",
        "image": "https://picsum.photos/seed/tomato/800/600",
        "description": "The edible berry of the plant Solanum lycopersicum, commonly known as a tomato plant. The species originated in western South America and Central America.",
        "planting": "Start seeds indoors 6-8 weeks before the last frost, or plant seedlings outdoors after the danger of frost has passed. Requires staking or caging for support.",
        "yield": "Varies widely. Can be anywhere from 10 to 30 tons per hectare for commercial growers.",
        "varieties": ["Roma", "Cherry", "Beefsteak", "Heirloom", "Grape"],
        "climate": "Warm-season crop that loves sunshine. Optimal temperature range is between 21°C and 29°C.",
        "soil": "Prefers well-drained, fertile soil rich in organic matter with a pH of 6.0 to 6.8."
    },
    {
        "name": "Lettuce",
        "image": "https://picsum.photos/seed/lettuce/800/600",
        "description": "An annual plant of the daisy family, Asteraceae. It is most often grown as a leaf vegetable, but sometimes for its stem and seeds. Lettuce is most often used for salads.",
        "planting": "A cool-weather crop that can be planted in early spring and fall. Can be sown directly or started indoors. Grows quickly.",
        "yield": "Around 20-30 tons per hectare.",
        "varieties": ["Romaine", "Iceberg", "Butterhead", "Leaf Lettuce"],
        "climate": "Prefers cooler temperatures (15-20°C). Can bolt (flower prematurely) in hot weather.",
        "soil": "Grows best in loose, well-drained sandy loam soil with plenty of organic matter. pH of 6.0 to 6.5."
    },
    {
        "name": "Carrot",
        "image": "https://picsum.photos/seed/carrot/800/600",
        "description": "A root vegetable, typically orange in color, though purple, black, red, white, and yellow cultivars exist. The plant probably originated in Persia and was originally cultivated for its leaves and seeds.",
        "planting": "Sow seeds directly in the garden in spring. Requires loose, sandy soil free of rocks to allow for good root development. Thin seedlings to prevent overcrowding.",
        "yield": "Average yield is around 40-50 tons per hectare.",
        "varieties": ["Danvers", "Nantes", "Imperator", "Chantenay"],
        "climate": "A cool-season crop, grows best at temperatures between 16°C and 21°C.",
        "soil": "Prefers deep, loose, well-drained sandy loam or peaty soils with a pH of 6.0 to 6.8."
    }
]
