
[
    {
        "name": "Wheat",
        "image": "https://picsum.photos/seed/wheat/800/600",
        "description": "A cereal grain, which is a worldwide staple food. The many species of wheat together make up the genus Triticum; the most widely grown is common wheat. It is a key source of carbohydrates and dietary fiber.",
        "planting": "Best planted in autumn for winter wheat or early spring for spring wheat. Requires well-drained soil and a sunny location. Typically sown using a drill in rows to ensure uniform depth and spacing.",
        "yield": "Average yield is about 3-4 tons per hectare, but can vary greatly depending on soil, climate, and farming practices.",
        "varieties": ["Hard Red Winter", "Soft Red Winter", "Hard Red Spring", "White Wheat", "Durum"],
        "climate": "Adaptable to various climates, but grows best in temperate regions with rainfall between 30 and 90 cm annually.",
        "soil": "Prefers well-drained loam or clay-loam soils with a pH between 6.0 and 7.0."
    },
    {
        "name": "Rice",
        "image": "https://picsum.photos/seed/rice/800/600",
        "description": "The seed of the grass species Oryza sativa (Asian rice) or Oryza glaberrima (African rice). As a cereal grain, it is the most widely consumed staple food for a large part of the world's human population.",
        "planting": "Typically grown in flooded paddies. Seedlings are first grown in a nursery and then transplanted into the fields. Requires significant water and a long, warm growing season.",
        "yield": "Average yield for irrigated rice is about 5-7 tons per hectare. Rain-fed rice yields are lower.",
        "varieties": ["Basmati", "Jasmine", "Arborio", "Brown Rice", "Sushi Rice"],
        "climate": "Requires a hot and humid climate. It is best suited to regions with high humidity, prolonged sunshine, and an assured supply of water.",
        "soil": "Best grown in clayey loam soils which can hold water for a long time. Ideal pH is between 5.5 and 6.5."
    },
    {
        "name": "Corn (Maize)",
        "image": "https://picsum.photos/seed/corn/800/600",
        "description": "A tall annual cereal grass that yields large grains, or kernels, set in rows on a cob. It is one of the most widely distributed of the world's food crops and is used for food, animal feed, and biofuel.",
        "planting": "Planted in spring in warm soil. Needs full sun and is often planted in blocks rather than single rows for better pollination. It's a heavy feeder, requiring nutrient-rich soil.",
        "yield": "Average yield can range from 8-12 tons per hectare under good conditions.",
        "varieties": ["Dent Corn", "Flint Corn", "Sweet Corn", "Popcorn", "Flour Corn"],
        "climate": "Requires warm nights and grows best in temperatures between 20°C and 30°C. Sensitive to frost.",
        "soil": "Prefers well-drained, fertile, loamy soils with good water-holding capacity and a pH of 6.0 to 6.8."
    },
    {
        "name": "Soybean",
        "image": "https://picsum.photos/seed/soybean/800/600",
        "description": "A species of legume native to East Asia, widely grown for its edible bean, which has numerous uses including soy milk, tofu, and soy oil. They are also a key component in animal feed.",
        "planting": "Planted in late spring once soil temperatures have warmed. Soybeans are nitrogen-fixing plants, which improves soil fertility.",
        "yield": "Average yield is about 2.5-3.5 tons per hectare.",
        "varieties": ["Glycine max", "Edamame", "Black Soybean"],
        "climate": "Grows best in warm and moist climates. Prefers temperatures between 20°C and 30°C.",
        "soil": "Adaptable to a wide range of soils, but grows best in moist, well-drained loams with a pH of 6.0 to 6.8."
    },
    {
        "name": "Potato",
        "image": "https://picsum.photos/seed/potato/800/600",
        "description": "A starchy tuber of the nightshade family Solanaceae, and the plant itself. Potatoes are a staple food in many parts of the world and an integral part of much of the world's food supply.",
        "planting": "Planted from 'seed potatoes' (small tubers). Plant in early spring. Requires hilling up soil around the plant to protect tubers from sunlight.",
        "yield": "Yields can range from 20 to 40 tons per hectare depending on the variety and conditions.",
        "varieties": ["Russet", "Yukon Gold", "Red Potato", "Fingerling", "Kennebec"],
        "climate": "Cool-weather crop. Ideal temperatures are between 15°C and 20°C. They are sensitive to frost.",
        "soil": "Prefers well-drained, sandy loam soil with a slightly acidic pH (5.8 to 6.5)."
    },
    {
        "name": "Tomato",
        "image": "https://picsum.photos/seed/tomato/800/600",
        "description": "The edible berry of the plant Solanum lycopersicum, commonly known as a tomato plant. The species originated in western South America and Central America.",
        "planting": "Start seeds indoors 6-8 weeks before the last frost, or plant seedlings outdoors after the danger of frost has passed. Requires staking or caging for support.",
        "yield": "Varies widely. Can be anywhere from 10 to 30 tons per hectare for commercial growers.",
        "varieties": ["Roma", "Cherry", "Beefsteak", "Heirloom", "Grape"],
        "climate": "Warm-season crop that loves sunshine. Optimal temperature range is between 21°C and 29°C.",
        "soil": "Prefers well-drained, fertile soil rich in organic matter with a pH of 6.0 to 6.8."
    },
    {
        "name": "Lettuce",
        "image": "https://picsum.photos/seed/lettuce/800/600",
        "description": "An annual plant of the daisy family, Asteraceae. It is most often grown as a leaf vegetable, but sometimes for its stem and seeds. Lettuce is most often used for salads.",
        "planting": "A cool-weather crop that can be planted in early spring and fall. Can be sown directly or started indoors. Grows quickly.",
        "yield": "Around 20-30 tons per hectare.",
        "varieties": ["Romaine", "Iceberg", "Butterhead", "Leaf Lettuce"],
        "climate": "Prefers cooler temperatures (15-20°C). Can bolt (flower prematurely) in hot weather.",
        "soil": "Grows best in loose, well-drained sandy loam soil with plenty of organic matter. pH of 6.0 to 6.5."
    },
    {
        "name": "Carrot",
        "image": "https://picsum.photos/seed/carrot/800/600",
        "description": "A root vegetable, typically orange in color, though purple, black, red, white, and yellow cultivars exist. The plant probably originated in Persia and was originally cultivated for its leaves and seeds.",
        "planting": "Sow seeds directly in the garden in spring. Requires loose, sandy soil free of rocks to allow for good root development. Thin seedlings to prevent overcrowding.",
        "yield": "Average yield is around 40-50 tons per hectare.",
        "varieties": ["Danvers", "Nantes", "Imperator", "Chantenay"],
        "climate": "A cool-season crop, grows best at temperatures between 16°C and 21°C.",
        "soil": "Prefers deep, loose, well-drained sandy loam or peaty soils with a pH of 6.0 to 6.8."
    },
    {
        "name": "Barley",
        "image": "https://picsum.photos/seed/barley/800/600",
        "description": "A member of the grass family, is a major cereal grain grown in temperate climates globally. It was one of the first cultivated grains and is now used for animal fodder, beer and other distilled beverages, and various health foods.",
        "planting": "Planted in spring or autumn. It has a short growing season and is relatively drought-tolerant compared to other cereals.",
        "yield": "Average yield is about 3-4 tons per hectare.",
        "varieties": ["Hulled Barley", "Pearl Barley", "Barley Grits"],
        "climate": "Adaptable to a wide range of climates, including high altitudes and latitudes.",
        "soil": "Grows well in well-drained loam soils with a pH of 6.0 to 8.5."
    },
    {
        "name": "Cotton",
        "image": "https://picsum.photos/seed/cotton/800/600",
        "description": "A soft, fluffy staple fiber that grows in a boll, or protective case, around the seeds of the cotton plants of the genus Gossypium. The fiber is almost pure cellulose.",
        "planting": "Planted in spring in consistently warm weather. Requires a long, frost-free period, plenty of sunshine, and moderate rainfall.",
        "yield": "Yield varies greatly, from 1 to 2.5 tons of lint per hectare.",
        "varieties": ["Pima", "Egyptian", "Upland"],
        "climate": "Requires a hot climate with long, sunny days.",
        "soil": "Prefers deep, well-drained, fertile loamy soils."
    },
    {
        "name": "Sugarcane",
        "image": "https://picsum.photos/seed/sugarcane/800/600",
        "description": "Several species of tall perennial true grasses of the genus Saccharum, used for sugar production. The plants are 2–6 m tall with stout, jointed, fibrous stalks that are rich in sucrose.",
        "planting": "Propagated from cuttings. Requires a tropical or subtropical climate, with a frost-free period of 9 to 12 months.",
        "yield": "Can yield 60 to 120 tons per hectare.",
        "varieties": ["Chewing Canes", "Crystal Canes", "Syrup Canes"],
        "climate": "Tropical and subtropical regions with high rainfall.",
        "soil": "Prefers well-drained, deep loams or volcanic soils with a pH between 5.0 and 8.0."
    },
    {
        "name": "Coffee",
        "image": "https://picsum.photos/seed/coffee/800/600",
        "description": "A brewed drink prepared from roasted coffee beans, the seeds of berries from certain Coffea species. The two most common sources of coffee beans are the highly regarded Coffea arabica, and the 'robusta' form of the hardier Coffea canephora.",
        "planting": "Grown in the 'Bean Belt', between the Tropics of Cancer and Capricorn. Trees require specific temperature and rainfall conditions.",
        "yield": "Yields average about 1 to 2 tons of green beans per hectare.",
        "varieties": ["Arabica", "Robusta", "Liberica", "Excelsa"],
        "climate": "Requires a stable climate with moderate temperatures and rainfall. Often grown at high altitudes.",
        "soil": "Deep, fertile, well-drained, and slightly acidic soils are ideal."
    },
    {
        "name": "Apple",
        "image": "https://picsum.photos/seed/apple/800/600",
        "description": "The fruit of the apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. The tree originated in Central Asia.",
        "planting": "Planted as grafted saplings. Requires a temperate climate with a cold winter period for dormancy. Cross-pollination is often necessary.",
        "yield": "A mature dwarf tree can produce 20-30 tons per hectare.",
        "varieties": ["Granny Smith", "Gala", "Fuji", "Red Delicious", "Honeycrisp"],
        "climate": "Temperate climates with a distinct winter chilling period.",
        "soil": "Prefers well-drained, loamy soil with a pH of 6.0 to 7.0."
    },
    {
        "name": "Grape",
        "image": "https://picsum.photos/seed/grape/800/600",
        "description": "A fruit, botanically a berry, of the deciduous woody vines of the flowering plant genus Vitis. Grapes can be eaten fresh as table grapes or they can be used for making wine, jam, grape juice, jelly, grape seed extract, raisins, vinegar, and grape seed oil.",
        "planting": "Propagated from cuttings. Vines require trellising and extensive pruning. They need a long season of warm to hot, dry weather.",
        "yield": "Table grape yields can be 20-30 tons per hectare; wine grapes are lower.",
        "varieties": ["Cabernet Sauvignon", "Chardonnay", "Merlot", "Thompson Seedless"],
        "climate": "Temperate to warm climates with long, dry summers.",
        "soil": "Well-drained soils are critical. Tolerant of a wide range of soil types."
    },
    {
        "name": "Onion",
        "image": "https://picsum.photos/seed/onion/800/600",
        "description": "Also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. Its close relatives include the garlic, shallot, leek, chive, and Chinese onion.",
        "planting": "Can be grown from seeds, sets (small bulbs), or transplants. Requires full sun and good soil drainage. Day-length is critical for bulb formation.",
        "yield": "Yields can range from 30 to 60 tons per hectare.",
        "varieties": ["Yellow Onion", "Red Onion", "White Onion", "Sweet Onion (Vidalia, Walla Walla)"],
        "climate": "Best in temperate climates. Bulb formation is triggered by day length, so variety choice is important.",
        "soil": "Prefers fertile, sandy loam soils with a pH of 6.0 to 6.8."
    },
    {
        "name": "Cabbage",
        "image": "https://picsum.photos/seed/cabbage/800/600",
        "description": "A leafy green, red, or white biennial plant grown as an annual vegetable crop for its dense-leaved heads. It is descended from the wild cabbage, and belongs to the 'cole crops' or brassicas.",
        "planting": "A cool-weather crop, planted in early spring or late summer for a fall harvest. Requires consistent moisture.",
        "yield": "Can yield between 40 and 70 tons per hectare.",
        "varieties": ["Green Cabbage", "Red Cabbage", "Savoy Cabbage", "Napa Cabbage"],
        "climate": "Cool and moist conditions are ideal. Can tolerate light frost.",
        "soil": "Requires fertile, well-drained soil with plenty of organic matter."
    }
]
